In [47]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:90% !important; }</style>"))

## **Pandas 에 대해**

Pandas는 2차원(row/col)으로 이루어진 데이터를 객체화하여 처리할 수 있게 해 주는 데이터분석 라이브러리 입니다.<br>

참고 링크:<br>
https://datascienceschool.net/view-notebook/704731b41f794b8ea00768f5b0904512/
https://datascienceschool.net/view-notebook/76dcd63bba2c4959af15bec41b197e7c/

다음과 같이 라이브러리를 import 합니다.

In [48]:
import pandas as pd

In [49]:

import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

실습에 사용할 kaggle titanic 데이터를 Pandas.read_csv()함수로 읽어 들입니다.<br>
read_csv()함수는 csv파일을 읽어들여 DataFrame객체를 생성해서 리턴합니다.

In [50]:
train = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

데이터가 많아서 100개로 줄임

In [51]:
dataframe = train.head(100)
dataframe.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,100.000000,100.000000,100.000000,100,100,78.000000,100.000000,100.000000,100,100.000000,20,99
unique,NaN,NaN,NaN,100,2,NaN,NaN,NaN,97,NaN,19,3
top,NaN,NaN,NaN,"Carrau, Mr. Francisco M",male,NaN,NaN,NaN,CA 2144,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,61,NaN,NaN,NaN,2,NaN,2,69
mean,50.500000,0.410000,2.400000,NaN,NaN,27.465769,0.730000,0.440000,NaN,29.517625,NaN,NaN
std,29.011492,0.494311,0.816497,NaN,NaN,15.278878,1.179411,0.967346,NaN,40.972905,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.830000,0.000000,0.000000,NaN,7.225000,NaN,NaN
25%,25.750000,0.000000,2.000000,NaN,NaN,18.250000,0.000000,0.000000,NaN,8.050000,NaN,NaN
50%,50.500000,0.000000,3.000000,NaN,NaN,26.000000,0.000000,0.000000,NaN,15.675000,NaN,NaN
75%,75.250000,1.000000,3.000000,NaN,NaN,34.750000,1.000000,0.000000,NaN,32.134375,NaN,NaN
max,100.000000,1.000000,3.000000,NaN,NaN,71.000000,5.000000,5.000000,NaN,263.000000,NaN,NaN

Series : index가 있는 1차원 배열<br>
DataFrame의 각각의 column이 Series이다.

In [52]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 12 columns):
PassengerId    100 non-null int64
Survived       100 non-null int64
Pclass         100 non-null int64
Name           100 non-null object
Sex            100 non-null object
Age            78 non-null float64
SibSp          100 non-null int64
Parch          100 non-null int64
Ticket         100 non-null object
Fare           100 non-null float64
Cabin          20 non-null object
Embarked       99 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 9.5+ KB

DataFrame의 데이터를 나열하고 싶으면 head()를 사용<br>
몇 줄을 출력할 것인지는 n에 값을 지정해서 할 수 있다.

In [53]:
dataframe.head(n=10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

DataFrame의 Column정보를 얻어보자

In [54]:
dataframe.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [55]:
#columns를 배열처럼 접근할 수 있다.
print("dataframe.columns[0]", dataframe.columns[0])
print("dataframe.columns[1]", dataframe.columns[1])

print()
# for/in 으로 각각의 항목을 얻을 수 있다.
for col in dataframe.columns:
    print(col)

dataframe.columns[0] PassengerId
dataframe.columns[1] Survived

PassengerId
Survived
Pclass
Name
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked

## DataFrame 인덱싱

DataFrame에 대괄호 안에 Column 이름을 넣어서 해당 Column의 데이터를 얻을 수 있다.

In [56]:
print(type(dataframe["Age"])) # type은 Series
print(dataframe["Age"].shape) #(891,)
print(dataframe["Age"]) # Age값을 얻을 수 있다.

<class 'pandas.core.series.Series'>
(100,)
0     22.00
1     38.00
2     26.00
3     35.00
4     35.00
5       NaN
6     54.00
7      2.00
8     27.00
9     14.00
10     4.00
11    58.00
12    20.00
13    39.00
14    14.00
15    55.00
16     2.00
17      NaN
18    31.00
19      NaN
20    35.00
21    34.00
22    15.00
23    28.00
24     8.00
25    38.00
26      NaN
27    19.00
28      NaN
29      NaN
      ...
70    32.00
71    16.00
72    21.00
73    26.00
74    32.00
75    25.00
76      NaN
77      NaN
78     0.83
79    30.00
80    22.00
81    29.00
82      NaN
83    28.00
84    17.00
85    33.00
86    16.00
87      NaN
88    23.00
89    24.00
90    29.00
91    20.00
92    46.00
93    26.00
94    59.00
95      NaN
96    71.00
97    23.00
98    34.00
99    34.00
Name: Age, Length: 100, dtype: float64

대괄호 안에 boolean array를 넣어 값을 선택해서 추출할 수 있다.<br>
대부분 조건식을 통해 값을 추출하려 할 때 사용한다.

In [57]:
# Age < 30인 사람들의 데이터를 얻는다.
print(dataframe[dataframe["Age"] < 30])

    PassengerId  Survived  Pclass  \
0             1         0       3
2             3         1       3
7             8         0       3
8             9         1       3
9            10         1       2
10           11         1       3
12           13         0       3
14           15         0       3
16           17         0       3
22           23         1       3
23           24         1       1
24           25         0       3
27           28         0       1
34           35         0       1
37           38         0       3
38           39         0       3
39           40         1       3
41           42         0       2
43           44         1       2
44           45         1       3
49           50         0       3
50           51         0       3
51           52         0       3
53           54         1       2
56           57         1       2
57           58         0       3
58           59         1       2
59           60         0       3
60           61         0       3
63           64         0       3
66           67         1       2
67           68         0       3
68           69         1       3
69           70         0       3
71           72         0       3
72           73         0       2
73           74         0       3
75           76         0       3
78           79         1       2
80           81         0       3
81           82         1       3
83           84         0       1
84           85         1       2
86           87         0       3
88           89         1       1
89           90         0       3
90           91         0       3
91           92         0       3
93           94         0       3
97           98         1       1

                                                 Name     Sex    Age  SibSp  \
0                             Braund, Mr. Owen Harris    male  22.00      1
2                              Heikkinen, Miss. Laina  female  26.00      0
7                      Palsson, Master. Gosta Leonard    male   2.00      3
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.00      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.00      1
10                    Sandstrom, Miss. Marguerite Rut  female   4.00      1
12                     Saundercock, Mr. William Henry    male  20.00      0
14               Vestrom, Miss. Hulda Amanda Adolfina  female  14.00      0
16                               Rice, Master. Eugene    male   2.00      4
22                        McGowan, Miss. Anna "Annie"  female  15.00      0
23                       Sloper, Mr. William Thompson    male  28.00      0
24                      Palsson, Miss. Torborg Danira  female   8.00      3
27                     Fortune, Mr. Charles Alexander    male  19.00      3
34                            Meyer, Mr. Edgar Joseph    male  28.00      1
37                           Cann, Mr. Ernest Charles    male  21.00      0
38                 Vander Planke, Miss. Augusta Maria  female  18.00      2
39                        Nicola-Yarred, Miss. Jamila  female  14.00      1
41  Turpin, Mrs. William John Robert (Dorothy Ann ...  female  27.00      1
43           Laroche, Miss. Simonne Marie Anne Andree  female   3.00      1
44                      Devaney, Miss. Margaret Delia  female  19.00      0
49      Arnold-Franchi, Mrs. Josef (Josefine Franchi)  female  18.00      1
50                         Panula, Master. Juha Niilo    male   7.00      4
51                       Nosworthy, Mr. Richard Cater    male  21.00      0
53  Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkin...  female  29.00      1
56                                  Rugg, Miss. Emily  female  21.00      0
57                                Novel, Mr. Mansouer    male  28.50      0
58                       West, Miss. Constance Mirium  female   5.00      1
59                 Goodwin, Master. William Frederick    male  11.00      5
60                              Sirayanian, Mr. Orsen    male  22.00      0
63                              Skoog, Master. Harald    male   4.00      3
66                       Nye, Mrs. (Elizabeth Ramell)  female  29.00      0
67                           Crease, Mr. Ernest James    male  19.00      0
68                    Andersson, Miss. Erna Alexandra  female  17.00      4
69                                  Kink, Mr. Vincenz    male  26.00      2
71                         Goodwin, Miss. Lillian Amy  female  16.00      5
72                               Hood, Mr. Ambrose Jr    male  21.00      0
73                        Chronopoulos, Mr. Apostolos    male  26.00      1
75                            Moen, Mr. Sigurd Hansen    male  25.00      0
78                      Caldwell, Master. Alden Gates    male   0.83      0
80                               Waelens, Mr. Achille    male  22.00      0
81                        Sheerlinck, Mr. Jan Baptist    male  29.00      0
83                            Carrau, Mr. Francisco M    male  28.00      0
84                                Ilett, Miss. Bertha  female  17.00      0
86                             Ford, Mr. William Neal    male  16.00      1
88                         Fortune, Miss. Mabel Helen  female  23.00      3
89                             Celotti, Mr. Francesco    male  24.00      0
90                               Christmann, Mr. Emil    male  29.00      0
91                         Andreasson, Mr. Paul Edvin    male  20.00      0
93                            Dean, Mr. Bertram Frank    male  26.00      1
97                    Greenfield, Mr. William Bertram    male  23.00      0

    Parch            Ticket      Fare        Cabin Embarked
0       0         A/5 21171    7.2500          NaN        S
2       0  STON/O2. 3101282    7.9250          NaN        S
7       1            349909   21.0750          NaN        S
8       2            347742   11.1333          NaN        S
9       0            237736   30.0708          NaN        C
10      1           PP 9549   16.7000           G6        S
12      0         A/5. 2151    8.0500          NaN        S
14      0            350406    7.8542          NaN        S
16      1            382652   29.1250          NaN        Q
22      0            330923    8.0292          NaN        Q
23      0            113788   35.5000           A6        S
24      1            349909   21.0750          NaN        S
27      2             19950  263.0000  C23 C25 C27        S
34      0          PC 17604   82.1708          NaN        C
37      0        A./5. 2152    8.0500          NaN        S
38      0            345764   18.0000          NaN        S
39      0              2651   11.2417          NaN        C
41      0             11668   21.0000          NaN        S
43      2     SC/Paris 2123   41.5792          NaN        C
44      0            330958    7.8792          NaN        Q
49      0            349237   17.8000          NaN        S
50      1           3101295   39.6875          NaN        S
51      0        A/4. 39886    7.8000          NaN        S
53      0              2926   26.0000          NaN        S
56      0        C.A. 31026   10.5000          NaN        S
57      0              2697    7.2292          NaN        C
58      2        C.A. 34651   27.7500          NaN        S
59      2           CA 2144   46.9000          NaN        S
60      0              2669    7.2292          NaN        C
63      2            347088   27.9000          NaN        S
66      0        C.A. 29395   10.5000          F33        S
67      0         S.P. 3464    8.1583          NaN        S
68      2           3101281    7.9250          NaN        S
69      0            315151    8.6625          NaN        S
71      2           CA 2144   46.9000          NaN        S
72      0      S.O.C. 14879   73.5000          NaN        S
73      0              2680   14.4542          NaN        C
75      0            348123    7.6500        F G73        S
78      2            248738   29.0000          NaN        S
80      0            345767    9.0000          NaN        S
81      0            345779    9.5000          NaN        S
83      0            113059   47.1000          NaN        S
84      0        SO/C 14885   10.5000          NaN        S
86      3        W./C. 6608   34.3750          NaN        S
88      2             19950  263.0000  C23 C25 C27        S
89      0            343275    8.0500          NaN        S
90      0            343276    8.0500          NaN        S
91      0            347466    7.8542          NaN        S
93      2         C.A. 2315   20.5750          NaN        S
97      1          PC 17759   63.3583      D10 D12        C

대괄호는 중복해서 사용할 수 있다.<br>
또한 한번에 여러 개의 항목을 선택할 수 있는데, 대신 여러 Column을 선택할 때는 여러 Column 나열한 것을 대괄호로 한번 더 감싸준다.

In [58]:
dataframe[["Age", "Fare"]]["Fare"]

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
5       8.4583
6      51.8625
7      21.0750
8      11.1333
9      30.0708
10     16.7000
11     26.5500
12      8.0500
13     31.2750
14      7.8542
15     16.0000
16     29.1250
17     13.0000
18     18.0000
19      7.2250
20     26.0000
21     13.0000
22      8.0292
23     35.5000
24     21.0750
25     31.3875
26      7.2250
27    263.0000
28      7.8792
29      7.8958
        ...
70     10.5000
71     46.9000
72     73.5000
73     14.4542
74     56.4958
75      7.6500
76      7.8958
77      8.0500
78     29.0000
79     12.4750
80      9.0000
81      9.5000
82      7.7875
83     47.1000
84     10.5000
85     15.8500
86     34.3750
87      8.0500
88    263.0000
89      8.0500
90      8.0500
91      7.8542
92     61.1750
93     20.5750
94      7.2500
95      8.0500
96     34.6542
97     63.3583
98     23.0000
99     26.0000
Name: Fare, Length: 100, dtype: float64

### **연습** : 
>dataframe에서 Age가 30 이상인 사람들의 Fare를 구하기

In [59]:
def get_df(df):
    ### start code here ###
    return None
    ### end code here ###    

print(get_df(dataframe))

None

기대 출력 :

1     71.2833
3     53.1000
4      8.0500
6     51.8625
11    26.5500
13    31.2750
15    16.0000
18    18.0000
20    26.0000
21    13.0000
25    31.3875
30    27.7208
33    10.5000
35    52.0000
40     9.4750
52    76.7292
54    61.9792
61    80.0000
62    83.4750
70    10.5000
74    56.4958
85    15.8500
92    61.1750
94     7.2500
96    34.6542
98    23.0000
99    26.0000
Name: Fare, dtype: float64

### ***연습:***
>dataframe에서 Cabin 정보가 없는 사람들의 Survived,Sex를 구하기

In [60]:
def get_df(df):
    ### start code here ###
    return None
    ### end code here ###    

print(get_df(dataframe))

None

기대 출력 :
    Survived     Sex
0          0    male
2          1  female
4          0    male
5          0    male
7          0    male
8          1  female
9          1  female
12         0    male
13         0    male
14         0  female
15         1  female
16         0    male
17         1    male
18         0  female
19         1  female
20         0    male
22         1  female
24         0  female
25         1  female
26         0    male
28         1  female
29         0    male
30         0    male
32         1  female
33         0    male
34         0    male
35         0    male
36         1    male
37         0    male
38         0  female
..       ...     ...
64         0    male
65         1    male
67         0    male
68         1  female
69         0    male
70         0    male
71         0  female
72         0    male
73         0    male
74         1    male
76         0    male
77         0    male
78         1    male
79         1  female
80         0    male
81         1    male
82         1  female
83         0    male
84         1  female
85         1  female
86         0    male
87         0    male
89         0    male
90         0    male
91         0    male
93         0    male
94         0    male
95         0    male
98         1  female
99         0    male

## **DataFrame 수정**

기본적으로 대괄호에 Column을 명시하고 값을 넣으면 해당 Column의 값이 모두 변경된다.

In [61]:
df = dataframe.copy()
df["Age"] = 100
print(df["Age"])

0     100
1     100
2     100
3     100
4     100
5     100
6     100
7     100
8     100
9     100
10    100
11    100
12    100
13    100
14    100
15    100
16    100
17    100
18    100
19    100
20    100
21    100
22    100
23    100
24    100
25    100
26    100
27    100
28    100
29    100
     ...
70    100
71    100
72    100
73    100
74    100
75    100
76    100
77    100
78    100
79    100
80    100
81    100
82    100
83    100
84    100
85    100
86    100
87    100
88    100
89    100
90    100
91    100
92    100
93    100
94    100
95    100
96    100
97    100
98    100
99    100
Name: Age, Length: 100, dtype: int64

대괄호 안에 조건식을 넣어서 조건에 해당하는 데이터만 수정할 수 있다.

In [62]:
df = dataframe.copy()
print("Age가 null인 데이터의 수:", df[df["Age"].isnull()].shape[0]) # Age항목이 비어있는 데이터의 수를 출력
print(df["Age"])
df[df["Age"].isnull()] = 50 #비어있는 데이터를 50으로 채운다.
print(df["Age"])

Age가 null인 데이터의 수: 22
0     22.00
1     38.00
2     26.00
3     35.00
4     35.00
5       NaN
6     54.00
7      2.00
8     27.00
9     14.00
10     4.00
11    58.00
12    20.00
13    39.00
14    14.00
15    55.00
16     2.00
17      NaN
18    31.00
19      NaN
20    35.00
21    34.00
22    15.00
23    28.00
24     8.00
25    38.00
26      NaN
27    19.00
28      NaN
29      NaN
      ...
70    32.00
71    16.00
72    21.00
73    26.00
74    32.00
75    25.00
76      NaN
77      NaN
78     0.83
79    30.00
80    22.00
81    29.00
82      NaN
83    28.00
84    17.00
85    33.00
86    16.00
87      NaN
88    23.00
89    24.00
90    29.00
91    20.00
92    46.00
93    26.00
94    59.00
95      NaN
96    71.00
97    23.00
98    34.00
99    34.00
Name: Age, Length: 100, dtype: float64
0     22.00
1     38.00
2     26.00
3     35.00
4     35.00
5     50.00
6     54.00
7      2.00
8     27.00
9     14.00
10     4.00
11    58.00
12    20.00
13    39.00
14    14.00
15    55.00
16     2.00
17    50.00
18    31.00
19    50.00
20    35.00
21    34.00
22    15.00
23    28.00
24     8.00
25    38.00
26    50.00
27    19.00
28    50.00
29    50.00
      ...
70    32.00
71    16.00
72    21.00
73    26.00
74    32.00
75    25.00
76    50.00
77    50.00
78     0.83
79    30.00
80    22.00
81    29.00
82    50.00
83    28.00
84    17.00
85    33.00
86    16.00
87    50.00
88    23.00
89    24.00
90    29.00
91    20.00
92    46.00
93    26.00
94    59.00
95    50.00
96    71.00
97    23.00
98    34.00
99    34.00
Name: Age, Length: 100, dtype: float64

길이에 맞는 배열을 넘겨서 설정할 수도 있다.

In [63]:
df = dataframe.copy()
ages = np.arange(df.shape[0]) # 0~99까지 값을 생성한다.
df["Age"] = ages
print(df["Age"])

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
26    26
27    27
28    28
29    29
      ..
70    70
71    71
72    72
73    73
74    74
75    75
76    76
77    77
78    78
79    79
80    80
81    81
82    82
83    83
84    84
85    85
86    86
87    87
88    88
89    89
90    90
91    91
92    92
93    93
94    94
95    95
96    96
97    97
98    98
99    99
Name: Age, Length: 100, dtype: int64

새로운 열은 그냥 대괄호에 새 이름을 넣고 값을 넣어주면 된다.

In [64]:
df = dataframe.copy()
print(df.columns)
bins = [-1, 0, 5, 12, 18, 24, 35, 60, np.inf]
labels = ['Unknown', 'Baby', 'Child', 'Teenager', 'Student', 'Young Adult', 'Adult', 'Senior']
'''
Pandas.cut()은 입력으로 받은 데이터를 bins 범위로 구분해서 맞는 label로 변경해서 리턴한다.
(리턴값이 Series이므로 Column을 선택한 Series에 넣어줄것)
'''
df["AgeGroup"] = pd.cut(df["Age"], bins, labels=labels)
print(df.columns)
print(df["AgeGroup"])

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'AgeGroup'],
      dtype='object')
0         Student
1           Adult
2     Young Adult
3     Young Adult
4     Young Adult
5             NaN
6           Adult
7            Baby
8     Young Adult
9        Teenager
10           Baby
11          Adult
12        Student
13          Adult
14       Teenager
15          Adult
16           Baby
17            NaN
18    Young Adult
19            NaN
20    Young Adult
21    Young Adult
22       Teenager
23    Young Adult
24          Child
25          Adult
26            NaN
27        Student
28            NaN
29            NaN
         ...
70    Young Adult
71       Teenager
72        Student
73    Young Adult
74    Young Adult
75    Young Adult
76            NaN
77            NaN
78           Baby
79    Young Adult
80        Student
81    Young Adult
82            NaN
83    Young Adult
84       Teenager
85    Young Adult
86       Teenager
87            NaN
88        Student
89        Student
90    Young Adult
91        Student
92          Adult
93    Young Adult
94          Adult
95            NaN
96         Senior
97        Student
98    Young Adult
99    Young Adult
Name: AgeGroup, Length: 100, dtype: category
Categories (8, object): [Unknown < Baby < Child < Teenager < Student < Young Adult < Adult < Senior]

**DataFrame에 대괄호를 사용할 때마다 새로운 객체가 생성되는 것과 동일하므로 다음과 같은 코드로는 값 변경이 안된다.(그대로임)**

In [65]:
df = dataframe.copy()
# Age가 비어있는 데이터에 값을 넣으려고 한다.
df[df["Age"].isnull()]["Age"] = 100
print(df["Age"].head(n=df.shape[0])) # NaN이 그대로 있음

0     22.00
1     38.00
2     26.00
3     35.00
4     35.00
5       NaN
6     54.00
7      2.00
8     27.00
9     14.00
10     4.00
11    58.00
12    20.00
13    39.00
14    14.00
15    55.00
16     2.00
17      NaN
18    31.00
19      NaN
20    35.00
21    34.00
22    15.00
23    28.00
24     8.00
25    38.00
26      NaN
27    19.00
28      NaN
29      NaN
      ...
70    32.00
71    16.00
72    21.00
73    26.00
74    32.00
75    25.00
76      NaN
77      NaN
78     0.83
79    30.00
80    22.00
81    29.00
82      NaN
83    28.00
84    17.00
85    33.00
86    16.00
87      NaN
88    23.00
89    24.00
90    29.00
91    20.00
92    46.00
93    26.00
94    59.00
95      NaN
96    71.00
97    23.00
98    34.00
99    34.00
Name: Age, Length: 100, dtype: float64

/usr/local/lib/python3.5/dist-packages/ipykernel/__main__.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  app.launch_new_instance()

위 상황에서 값을 설정하기 위해서는 DataFrame에서 지원하는 인덱서 함수를 사용해야 한다.

### loc 인덱서
다음과 같이 사용한다.
    DataFrame.[row 인덱싱 값, col 인덱싱 값]
    
인덱스데이터의 종류 :
- 인덱스데이터 슬라이스
- 인덱스데이터 리스트
- 같은 행 인덱스를 가지는 불리언 시리즈 (행 인덱싱의 경우)
- 또는 위의 값들을 반환하는 함수

위와 같은 경우 아래와 같이 loc[boolean값, [column 이름]]에 값을 넣어서 해결할 수 있다.

In [66]:
df = dataframe.copy()
#df[df["Age"].isnull()]["Age"] = 100
df.loc[df["Age"].isnull(), ["Age"]] = 100 # loc(boolean 값, column 이름)로 값을 읽거나 설정할 수 있다.
print(df["Age"])

0      22.00
1      38.00
2      26.00
3      35.00
4      35.00
5     100.00
6      54.00
7       2.00
8      27.00
9      14.00
10      4.00
11     58.00
12     20.00
13     39.00
14     14.00
15     55.00
16      2.00
17    100.00
18     31.00
19    100.00
20     35.00
21     34.00
22     15.00
23     28.00
24      8.00
25     38.00
26    100.00
27     19.00
28    100.00
29    100.00
       ...
70     32.00
71     16.00
72     21.00
73     26.00
74     32.00
75     25.00
76    100.00
77    100.00
78      0.83
79     30.00
80     22.00
81     29.00
82    100.00
83     28.00
84     17.00
85     33.00
86     16.00
87    100.00
88     23.00
89     24.00
90     29.00
91     20.00
92     46.00
93     26.00
94     59.00
95    100.00
96     71.00
97     23.00
98     34.00
99     34.00
Name: Age, Length: 100, dtype: float64

행번호로 범위를 지정해서 얻을 수도 있다.

In [67]:
df.loc[0:5] #0번째부터 5까지(행 인덱스가 정수이면 레이블 슬라이싱 방식에 따라 5도 포함된다.)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,100.0,0,0,330877,8.4583,NaN,Q

loc[]안에 여러 column 이름을 넣어서 여러 column을 추출해 낼 수도 있다.
여러 열을 추출할 경우 아래 예와 같이 column이름들을 대괄호로 묶어서 넘겨준다.

In [68]:
df[["Age", "Fare"]].head()

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

조건식을 통해 조건이 맞는 행만 고를 수도 있다.<br>
- 두번째에 column 이름을 넣을 수 있으므로 연속적인 대괄호로 인한 copy가 일어나지 않음

In [69]:
dataframe.loc[dataframe["Age"].isnull()].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [70]:
dataframe.loc[dataframe["Age"] > 50].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

In [71]:
dataframe.loc[dataframe["Age"] > 50, ["Name"]] #위 식에서 Name만 얻어서 Series 타입을 얻는다.

                                Name
6            McCarthy, Mr. Timothy J
11          Bonnell, Miss. Elizabeth
15  Hewlett, Mrs. (Mary D Kingcome)
33             Wheadon, Mr. Edward H
54    Ostby, Mr. Engelhart Cornelius
94                 Coxon, Mr. Daniel
96         Goldschmidt, Mr. George B

### iloc 인덱서
loc 인덱서와 다르게 라벨이 아니라 순서를 나타내는 정수만 인자로 받는다.<br>그 외 동작방식은 loc와 간다.

In [72]:
print(dataframe.columns)
dataframe.iloc[[0,1,2], [0,1,2,]]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3

In [73]:
for i in range(5):
    print(dataframe.iloc[i, [0,1,2]])

PassengerId    1
Survived       0
Pclass         3
Name: 0, dtype: object
PassengerId    2
Survived       1
Pclass         1
Name: 1, dtype: object
PassengerId    3
Survived       1
Pclass         3
Name: 2, dtype: object
PassengerId    4
Survived       1
Pclass         1
Name: 3, dtype: object
PassengerId    5
Survived       0
Pclass         3
Name: 4, dtype: object

In [74]:
dataframe.iloc[0:10, [5,6]]

    Age  SibSp
0  22.0      1
1  38.0      1
2  26.0      0
3  35.0      1
4  35.0      0
5   NaN      0
6  54.0      0
7   2.0      3
8  27.0      0
9  14.0      1

### at, iat 인덱서
값 하나만 뽑아야 할 때 사용한다. 빠른 인덱싱 속도가 필요할 때 사용한다.

In [75]:
for i in range(10):
    print(dataframe.at[i, "Age"])

22.0
38.0
26.0
35.0
35.0
nan
54.0
2.0
27.0
14.0

In [76]:
print(dataframe.columns.values)
for i in range(dataframe.shape[0]): #전체 데이터에 대해 for loop
    if dataframe.at[i, "Age"] == 20: # 20살이면,
        print(dataframe.iloc[i]) #출력

['PassengerId' 'Survived' 'Pclass' 'Name' 'Sex' 'Age' 'SibSp' 'Parch'
 'Ticket' 'Fare' 'Cabin' 'Embarked']
PassengerId                                13
Survived                                    0
Pclass                                      3
Name           Saundercock, Mr. William Henry
Sex                                      male
Age                                        20
SibSp                                       0
Parch                                       0
Ticket                              A/5. 2151
Fare                                     8.05
Cabin                                     NaN
Embarked                                    S
Name: 12, dtype: object
PassengerId                            92
Survived                                0
Pclass                                  3
Name           Andreasson, Mr. Paul Edvin
Sex                                  male
Age                                    20
SibSp                                   0
Parch                                   0
Ticket                             347466
Fare                               7.8542
Cabin                                 NaN
Embarked                                S
Name: 91, dtype: object

### **연습** : 
>비어있는 Cabin에 "Unknown" 문자열을 채우기

In [77]:
df = dataframe.copy()

def fill_cabin_unknown(df):
    ### start code here ###
    
    ### end code here ###
    return df

df = fill_cabin_unknown(df)
print(df["Cabin"])

0             NaN
1             C85
2             NaN
3            C123
4             NaN
5             NaN
6             E46
7             NaN
8             NaN
9             NaN
10             G6
11           C103
12            NaN
13            NaN
14            NaN
15            NaN
16            NaN
17            NaN
18            NaN
19            NaN
20            NaN
21            D56
22            NaN
23             A6
24            NaN
25            NaN
26            NaN
27    C23 C25 C27
28            NaN
29            NaN
         ...
70            NaN
71            NaN
72            NaN
73            NaN
74            NaN
75          F G73
76            NaN
77            NaN
78            NaN
79            NaN
80            NaN
81            NaN
82            NaN
83            NaN
84            NaN
85            NaN
86            NaN
87            NaN
88    C23 C25 C27
89            NaN
90            NaN
91            NaN
92            E31
93            NaN
94            NaN
95            NaN
96             A5
97        D10 D12
98            NaN
99            NaN
Name: Cabin, Length: 100, dtype: object

기대 출력:
 
0         Unknown
1             C85
2         Unknown
3            C123
4         Unknown
5         Unknown
6             E46
7         Unknown
8         Unknown
9         Unknown
10             G6
11           C103
12        Unknown
13        Unknown
14        Unknown
15        Unknown
16        Unknown
17        Unknown
18        Unknown
19        Unknown
20        Unknown
21            D56
22        Unknown
23             A6
24        Unknown
25        Unknown
26        Unknown
27    C23 C25 C27
28        Unknown
29        Unknown
         ...     
70        Unknown
71        Unknown
72        Unknown
73        Unknown
74        Unknown
75          F G73
76        Unknown
77        Unknown
78        Unknown
79        Unknown
80        Unknown
81        Unknown
82        Unknown
83        Unknown
84        Unknown
85        Unknown
86        Unknown
87        Unknown
88    C23 C25 C27
89        Unknown
90        Unknown
91        Unknown
92            E31
93        Unknown
94        Unknown
95        Unknown
96             A5
97        D10 D12
98        Unknown
99        Unknown
Name: Cabin, Length: 100, dtype: object

### **연습:**
>Parch와 SibSp 값을 합해서 Family라는 항목을 추가한다.

In [78]:
df = dataframe.copy()

### start code here ###
None
### end code here ###

if "Family" in df:
    print(df["Family"].sum())

기대 출력:
117.0

### **연습:**
>Embarked 중 가장 갯수가 많은 것을 찾아서 null값에 채운다.

갯수가 가장 많은 것을 확인하려면 column을 선택한 Series에 **value_counts()**를 호출해서 얻을 수 있다.

In [79]:
df = dataframe.copy()
### start code here ###

### end code here ###
print(df[df["Embarked"].isnull()].shape[0])

1

기대 출력:
0

### **연습:**
>Name에서 Mrs., Miss. 등의 호칭을 추출해서 Title항목을 추가한다.

이름 항목에서 호칭을 추출하는 것은 Series.str.extract()와 <br>
'([A-Za-z]+)\. ' 정규표현식을 사용.

In [80]:
df = dataframe.copy()
### start code here ###

### end code here ###
if "Title" in df:
    print(df["Title"].unique())

기대 출력:
['Mr' 'Mrs' 'Miss' 'Master' 'Don']

## 그룹 분석

groupby()메소드를 통해 선택한 column의 데이터 종류별로 데이터를 분류할 수 있다.<br>
groupby()에는 다음을 인수로 사용한다.
- 열 또는 열의 리스트
- 행 인덱스

<br>
<br>

groupby()함수는 값의 종류별로 묶인 데이터를 나타내는 GroupBy 클래스 객체를 반환한다.<br>

- size, count: 그룹 데이터의 갯수
- mean, median, min, max: 그룹 데이터의 평균, 중앙값, 최소, 최대
- sum, prod, std, var, quantile : 그룹 데이터의 합계, 곱, 표준편차, 분산, 사분위수
- first, last: 그룹 데이터 중 가장 첫번째 데이터와 가장 나중 데이터

Pclass당 생존자 수를 계산해 본다.

In [81]:
print(dataframe[["Pclass", "Survived"]].groupby(["Pclass"]))

<pandas.core.groupby.groupby.DataFrameGroupBy object at 0x7f8d9d2f9a90>

Pclass와 Survived를 선택헤서 Pclass로 group화하고 Survived값을 합한다.

In [82]:
dataframe[["Pclass", "Survived"]].groupby(["Pclass"]).sum()

        Survived
Pclass
1             10
2             12
3             19

Survived에서 1이 산 것으로 0이 죽은 것이므로 평균을 내면 생존률 값을 얻을 수 있다.

In [83]:
dataframe[["Pclass", "Survived"]].groupby(["Pclass"]).mean()

        Survived
Pclass
1       0.476190
2       0.666667
3       0.311475

group에 속한 데이터의 수를 확인하려면 size()를 호출한다.

In [84]:
dataframe[["Pclass", "Embarked"]].groupby(["Pclass"]).size()

Pclass
1    21
2    18
3    61
dtype: int64

[df["Survived"] == 1] 조건을 추가했으니 Survived의 평균은 모두 1이 된다.

In [85]:
dataframe[["Pclass", "Survived"]][df["Survived"] == 1].groupby(["Pclass"]).mean()

        Survived
Pclass
1              1
2              1
3              1

### **연습:**

>성별과 생존여부를 모아서 성별로 그룹화하여 생존률을 출력

In [86]:
### start code here ###
None
#end code here ###

기대 출력:

        Survived
Sex	
female	0.794872
male	0.163934

### **연습:**

>Pclass에 따른 평균 나이대를 출력

In [87]:
### start code here ###
None
#end code here ###

기대 출력:

        Age
Pclass           
1       40.555556
2       26.872353
3       22.220930

## 추가 연습문제 ##

>Fare 값의 편차가 크므로 Fare값에 log를 취한다.

In [88]:
df = dataframe.copy()
### start code here ###
None
#end code here ###
print(df["Fare"].head())

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

기대 출력:

0    1.981001
1    4.266662
2    2.070022
3    3.972177
4    2.085672
Name: Fare, dtype: float64

>Cabin이 빈 데이터를 채우려 한다.<br>
같은 Ticket을 가진 사람의 Cabin을 채우려고 하는데, 이렇게 채울 수 있는 사람의 총 수를 구한다.

- iterrows() : DataFrame에 호출해서 iterator를 얻을 수 있다.(index, row)를 넘겨준다.

In [89]:
df = test.copy()

def empty_cabin_but_oterhs_have_cabin_cnt(df):
    ret = 0    
    for idx, row in df[df["Cabin"].isnull() == True].iterrows(): #Cabin이 없는 행에 대해 loop 를 돈다.      
        ### start code here ###
        pass
        ### end code here ###
    return ret

print("count of fillable cabin : ", empty_cabin_but_oterhs_have_cabin_cnt(df))

count of fillable cabin :  0

기대 출력:
count of fillable cabin :  3